In [1]:
import numpy as np
import pandas as pd

In [8]:
dict1={'NAME':['Ramesh','Suresh',np.nan,'Mahesh'],
   'AGE':[31,32,33,np.nan],
   'city':[np.nan,'hyd','mumbai','chennai']}
data1=pd.DataFrame(dict1)
data1

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2     NaN  33.0   mumbai
3  Mahesh   NaN  chennai

In [9]:
data1.isnull()

    NAME    AGE   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [16]:
data1.isnull().sum()

NAME    1
AGE     1
city    1
dtype: int64

In [11]:
data1.isnull().sum()*100/len(data1)

NAME    25.0
AGE     25.0
city    25.0
dtype: float64

In [13]:
dict2={'NAME':['Ramesh','Suresh',None,'Mahesh'],
   'AGE':[31,32,33,None],
   'city':[None,'hyd','mumbai','chennai']}
data2=pd.DataFrame(dict2)
data2

#none is for categorical
#np.nan is for numerical

     NAME   AGE     city
0  Ramesh  31.0     None
1  Suresh  32.0      hyd
2    None  33.0   mumbai
3  Mahesh   NaN  chennai

In [14]:
dict3={'NAME':['Ramesh','Suresh','nulll','Mahesh'],
   'AGE':[31,32,33,'null'],
   'city':['null','hyd','mumbai','chennai']}
data3=pd.DataFrame(dict3)
data3

     NAME   AGE     city
0  Ramesh    31     null
1  Suresh    32      hyd
2   nulll    33   mumbai
3  Mahesh  null  chennai

**method-1**

- fill the missing values with random numbers

- dtata frame name is data1

- method name is name.fillna

In [17]:
data1.fillna(40)

     NAME   AGE     city
0  Ramesh  31.0       40
1  Suresh  32.0      hyd
2      40  33.0   mumbai
3  Mahesh  40.0  chennai

**method-2**

- fill the missing values based on specific column

In [20]:
data1['NAME'].fillna('satish',inplace=True)
data1

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh   NaN  chennai

In [ ]:
#create the data again
dict1={'NAME':['Ramesh','Suresh',np.nan,'Mahesh'],
   'AGE':[31,32,33,np.nan],
   'city':[np.nan,'hyd','mumbai','chennai']}
data1=pd.DataFrame(dict1)
data1

**method-3**

- bfill

- ffill

- pad

- backfill

In [21]:
data1.fillna(method='backfill')
#names index 2 is missed value
#it will replace by index3 value
#age at index3 is missed value
#we dont have index4,so the value is NaN
#city index0 has missed value
#it replace with index1 value

     NAME   AGE     city
0  Ramesh  31.0      hyd
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh   NaN  chennai

In [22]:
data1.fillna(method='pad')

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh  33.0  chennai

In [23]:
data1.fillna(method='ffill')

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh  33.0  chennai

In [32]:
data1.fillna(method='bfill')

     NAME   AGE     city
0  Ramesh  31.0      hyd
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh   NaN  chennai

- bfill and backfill both are same

- pad and ffill both are samem

In [ ]:
**method-4**

- mean

- median

- mode

In [28]:
data1

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh   NaN  chennai

In [30]:
age_mean=data1['AGE'].mean()
age_mean

#instead of providing random number
#we are filling with mean of data

32.0

In [34]:
data1['AGE'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: AGE, dtype: float64

In [36]:
age_median=data1['AGE'].median()
age_median

32.0

In [37]:
data1['AGE'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: AGE, dtype: float64

**method-5** **KNN imputer**

KNN: k nearest neighbours
    
- in the KNN imputer instead of taking mean of all the values

- we will choose neighbours data, we will take those mean only

- this is only for numerical data not for categorical

**KNN imputer**

In [40]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['AGE']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [41]:
data1

     NAME   AGE     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  satish  33.0   mumbai
3  Mahesh   NaN  chennai

**method-6**

- based on other columns

- some times all above methods will not provide good justification

- at that time we need to check other columns dependency also

- most of the time we will pick a column which have highest corelations